START = f"""
Привет 👋! Я админ чата @DigitalNomadsComunity

Вот, что вы можете сделать с моей помощью:
"""

# strike
STRIKE_INPUT_EXAMPLE = 'Пример: `@somebody`, или `Валерий Петров`'

STRIKE_1 = "Подалуйста, напишите никнейм, или полное имя человека 🤡, которого хотите зарепортить (это анонимно 🗣). \n" + STRIKE_INPUT_EXAMPLE
STRIKE_2 = "🔎 Что-то не так. Проверьте, пожалуйста, все ли правильно ввели. \n" + STRIKE_INPUT_EXAMPLE
STRIKE_2_1 = "😳 За что вы так со мной? Я не могу забанить себя..."
STRIKE_2_2 = "Нашел. 🤷 Но вы уже жаловались на пользователя `{}`. Принимается только 1 жалоба от 1 человека❗️ \nP.S. Скоро можно будет удалить жалобу и создать новую."
STRIKE_3 = "Есть такой. 📋 Опишите, пожалуйста, причину жалобы (это анонимно 🗣):"
STRIKE_4_1 = "🗣 Жалоба на пользователя {}. Причина: '{}'."
STRIKE_4_2 = "Если все верно, напишите '`Да`' ✅ для подтверждения, или '`Нет`' ❌ для отмены:"
STRIKE_5 = "Жалоба записана ✅. Спасибо за вклад в сообщество!"
STRIKE_6 = "Жалоба отменена ❌. Спасибо за визит!"

# ERRORS

NOT_MEMBER = "Привет 👋! Извини, ты не учасник сообщества @DigitalNomadsComunity 🤷 "

ERROR_BASIC = "🙈 Что-то пошло не так. Пожалуйста, попробуйте еще раз... /menu"
